# Lesson #4
## Pandas

In [1]:
import pandas as pd

In [2]:
ratings = pd.read_csv('data/movielens/ratings.csv')

In [3]:
ratings.head(3)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224

In [4]:
ratings.tail(3)

        userId  movieId  rating   timestamp
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

In [5]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [6]:
# Number of unique films
len(ratings.movieId.unique())

9724

In [7]:
# Which user had put most ratings
ratings.groupby('userId').count().sort_values('movieId', ascending=False).head()

        movieId  rating  timestamp
userId
414        2698    2698       2698
599        2478    2478       2478
474        2108    2108       2108
448        1864    1864       1864
274        1346    1346       1346

In [8]:
# Which movie has the highest number of ratings (not highest rating)
ratings.groupby('movieId').count().sort_values('rating', ascending=False).head()

         userId  rating  timestamp
movieId
356         329     329        329
318         317     317        317
296         307     307        307
593         279     279        279
2571        278     278        278

In [9]:
%%time

ratings_grouped = ratings.groupby('userId').agg([min, max])
ratings_grouped['diff'] = ratings_grouped['timestamp']['max'] - ratings_grouped['timestamp']['min']

ratings_grouped['diff'].mean() / 24 / 3600

CPU times: total: 15.6 ms
Wall time: 17 ms

234.29512251442014

In [10]:
movies = pd.read_csv('data/movielens//movies.csv')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

Join two tables

In [11]:
# joined = ratings.merge(movies, on='movieId', how='right')
joined = movies.merge(ratings, on='movieId', how='left')
joined.head()

,movieId,title,genres,userId,rating,timestamp
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1.0,4.0,9.649827e+08
1,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,5.0,4.0,8.474350e+08
2,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,7.0,4.5,1.106636e+09
3,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,15.0,2.5,1.510578e+09
4,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,17.0,4.5,1.305696e+09

In [12]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'

# Импортируем нужную нам страницу в df
# attrs = {'class': 'news_table'} ---> указываем какой именно блок нам нужен
# encoding='utf-8' ---> указываем кодировку страниц для корректного отображения кириллицы
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')
df[:5]

[       Дата  Закрытие  Открытие  Максимум  Минимум
 0  05.08.22    605250    618500    618500   601249
 1  04.08.22    620000    616100    627201   599250
 2  03.08.22    627200    607501    627200   558250
 3  02.08.22    607500    623750    623750   594859
 4  01.08.22    615000    622500    643320   605330
 5  30.07.22    622500    622500    622500   622500
 6  29.07.22    622500    625000    640475   604750
 7  28.07.22    625000    593750    627501   592750
 8  27.07.22    593750    601251    617750   593749,
        Имя  Unnamed: 1      %    курс                 Дата
 0  EUR/RUB         NaN -22096  616356  06.08.2022 00:09:00
 1  USD/RUB         NaN  -2379   60525  05.08.2022 21:19:00
 2  CHF/RUB         NaN    104   62942  06.08.2022 06:03:00
 3  JPY/RUB         NaN    686    4486  06.08.2022 06:03:00
 4  GBP/RUB         NaN      0  730718  06.08.2022 06:03:00
 5  NOK/RUB         NaN      0   61779  06.08.2022 06:03:00
 6  AUD/RUB         NaN      0  418288  06.08.2022 06:03:00
 7  NZD/RUB         NaN     57  377274  06.08.2022 06:03:00
 8  TRY/RUB         NaN      0   33797  06.08.2022 06:03:00]

In [13]:
data = pd.read_csv('data/test/power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [14]:
len(data)
data.shape

(1189482, 4)

In [15]:
new_data = pd.read_csv('data/test/transactions.csv')
new_data.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [16]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Year     60 non-null     int64
 1   Month    60 non-null     int64
 2   ID       60 non-null     object
 3   Product  60 non-null     object
 4   Amount   60 non-null     int64
 5   Price    60 non-null     int64
 6   Total    60 non-null     int64
 7   Cost     60 non-null     int64
dtypes: int64(6), object(2)
memory usage: 3.9+ KB

In [17]:
new_data.to_csv('data/results/transactions.csv')

In [18]:
new_data.describe()

         Year      Month     Amount        Price         Total         Cost
count    60.0  60.000000  60.000000    60.000000     60.000000    60.000000
mean   2017.0   7.250000   3.650000  4427.183333  14072.183333  1063.333333
std       0.0   3.337638   2.184886  2506.427558   8966.190387   902.297757
min    2017.0   1.000000   1.000000  1265.000000   1896.000000   200.000000
25%    2017.0   5.000000   2.000000  1896.000000   7584.000000   650.000000
50%    2017.0   7.000000   3.000000  3760.000000  11280.000000   800.000000
75%    2017.0  10.250000   5.000000  5175.000000  17236.000000  1200.000000
max    2017.0  12.000000  10.000000  8618.000000  37600.000000  4200.000000

In [19]:
new_data[new_data.Price.isnull()]

Empty DataFrame
Columns: [Year, Month, ID, Product, Amount, Price, Total, Cost]
Index: []

In [20]:
data.describe()

               year      quantity      category
count  1.189482e+06  1.189482e+06  1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01
std    7.167345e+00  1.585663e+07  1.809968e+01
min    1.990000e+03 -8.643480e+05  1.000000e+00
25%    1.997000e+03  1.400000e+01  2.400000e+01
50%    2.003000e+03  1.890000e+02  3.500000e+01
75%    2.009000e+03  2.265000e+03  5.100000e+01
max    2.014000e+03  6.680329e+09  7.100000e+01

Series

In [21]:
type(data['year'])

pandas.core.series.Series

In [22]:
data['year'].head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [23]:
data.year.head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [24]:
data.year.unique()

array([1996, 1995, 2014, 2013, 2012, 2011, 2010, 2009, 1998, 2008, 2007,
       2006, 2005, 2004, 2003, 2002, 2001, 2000, 1999, 1997, 1994, 1993,
       1992, 1991, 1990], dtype=int64)

In [25]:
data['year'].value_counts().head(10)

2014    56264
2013    56109
2012    55838
2011    55214
2010    54544
2008    53852
2009    53769
2007    52248
2006    49397
2005    49203
Name: year, dtype: int64

In [26]:
data['year'].value_counts(normalize=True).head(10)

2014    0.047301
2013    0.047171
2012    0.046943
2011    0.046419
2010    0.045855
2008    0.045273
2009    0.045204
2007    0.043925
2006    0.041528
2005    0.041365
Name: year, dtype: float64

In [27]:
data = pd.read_csv('data/test/transactions.csv')

In [28]:
data['Product'].value_counts().head(1)

_5    11
Name: Product, dtype: int64

Filters

In [58]:
data = pd.read_csv('data/test/power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [30]:
# Create df with only columns
country_stats = data.filter(items=['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [61]:
# Or
country_stats = data[['country', 'quantity']]
country_stats.head()

                      country  quantity
265243   Central African Rep.       3.0
305388               Thailand      21.0
1092939                 Congo     350.0
980667         United Kingdom     681.0
604843    Antigua and Barbuda      27.0

In [32]:
# Get countries with > average
average = data['quantity'].mean()
data[ data.quantity > average ]

                    country  year  quantity  category
3228          United States  2014  367987.0         2
3229          United States  2013  384439.0         2
3230          United States  2012  370625.0         2
3231          United States  2011  310909.0         2
3232          United States  2010  335418.0         2
...                     ...   ...       ...       ...
1178016  Russian Federation  2014  216500.0        69
1178017  Russian Federation  2011  218300.0        69
1178022        South Africa  2011  192900.0        69
1178029       United States  2014  207400.0        69
1178030       United States  2011  472100.0        69

[28093 rows x 4 columns]

In [33]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

In [35]:
data[ data['country'].str.contains('us', case=False) ]['country'].unique()

array(['Austria', 'Brunei Darussalam', 'Australia', 'Russian Federation',
       'USSR (former)', 'Mauritius', 'Belarus', 'Cyprus',
       'Bonaire, St Eustatius, Saba'], dtype=object)

In [39]:
filtered_countries = data[ (data['country'] == 'USSR (former)') | (data['country'] == 'Russian Federation') ]
filtered_countries

15370

In [40]:
filtered_countries = data[data.country.isin(['Kenya', 'Jamaica'])]
filtered_countries

         country  year  quantity  category
10962    Jamaica  2005       1.0         4
10963    Jamaica  2004       0.0         4
10964    Jamaica  2003       1.0         4
10965    Jamaica  2002       1.0         4
10966    Jamaica  2001       1.0         4
...          ...   ...       ...       ...
1188805    Kenya  2011      17.6        71
1188806    Kenya  2010      16.8        71
1188807    Kenya  2009       7.2        71
1188808    Kenya  2008       0.2        71
1188809    Kenya  2007       0.0        71

[9148 rows x 4 columns]

In [60]:
data.loc[1000:1005]

Empty DataFrame
Columns: [country, year, quantity, category]
Index: []

In [54]:
data.sort_values(by='year', ascending=False).head()

         country  year  quantity  category
48055    Romania  2014     109.0         7
527583   Ukraine  2014      18.0        31
1046653  Denmark  2014   10104.0        67
785349     China  2014       0.0        42
1167103  Croatia  2014     118.0        67

In [52]:
# Sort by multiple columns
data.sort_values(by=['year', 'country', 'quantity'], ascending=[False, True, False]).head()

            country  year      quantity  category
835127  Afghanistan  2014  1.935442e+06        42
491541  Afghanistan  2014  6.600000e+04        31
492004  Afghanistan  2014  6.600000e+04        31
492292  Afghanistan  2014  6.600000e+04        31
791301  Afghanistan  2014  5.537080e+03        42

Change data frame (inplace)

In [59]:
data.sort_values('year', ascending=True, inplace=True)